      *MI PRIMER PROGRAMA
       IDENTIFICATION DIVISION.
        PROGRAM-ID. PRAC1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       INICIO.
           DISPLAY SPACES LINE 01 POSITION 01 ERASE.
           DISPLAY "HOLA MUNDO" LINE 03 POSITION 01.
           STOP RUN.