      *MI SEGUNDO PROGRAMA
       IDENTIFICATION DIVISION.
        PROGRAM-ID. PRAC2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WSNOMBRE-REG.
        02 WSNOMBRE PIC X(20).
        02 WSAPELLIDOP PIC X(20).
        02 WSAPELLIDOM PIC X(20).
        
       PROCEDURE DIVISION.
       INICIO.
           DISPLAY SPACES LINE 01 POSITION 01 ERASE.
           
           DISPLAY "INGRESA TU NOMBRE" LINE 03 POSITION 03.
           ACCEPT WSNOMBRE LINE 03 POSITION 21.
           
           DISPLAY "INGRESA TU APELLIDO PATERNO" LINE 04 POSITION 03.
           ACCEPT WSAPELLIDOP LINE 04 POSITION 31.
           
           DISPLAY "INGRESA TU APELLIDO MATERNO" LINE 05 POSITION 03.
           ACCEPT WSAPELLIDOM LINE 05 POSITION 31.
           
           DISPLAY "TU NOMBRE COMPLETO ES:" LINE 06 POSITION 03.
           DISPLAY WSNOMBRE LINE 06 POSITION 25.
           DISPLAY WSAPELLIDOP LINE 06 POSITION 35.
           DISPLAY WSAPELLIDOM LINE 06 POSITION 45.
           
           STOP RUN.